# Условные операторы

# if not 1 - если нужно проверить булево значение 1 на False 
# and - условие "если"
# or - условие "или"
# 
# --------------------------------------------------#


# if 5 > 5:
#   print("Yes")
# --------------------------------------------------#


# user_data = int(input("Введите число: "))

# if user_data != 5:
#   print("Мы на месте")
#   if user_data > 6:
#     print("Номер больше 5")
# --------------------------------------------------#

# isHappy = False
# user_data = int(input("Введите число: "))

# if isHappy and user_data == 6:
#   print("Пользователь счастливв")
# elif user_data ==5:
#   print("Введённое число равно пяти")
# else:
#   print("Пользователь не счастлив")
# --------------------------------------------------#


data = int(input("Введите число: "))
number = 5 if data == 5 else 0

print("Записаны данные в переменную number:", number)