# Циклы и операторы в них (for, while)
# --------------------------------------------------#


# range(1) - диапазон цикла for, где 1 - количество циклов (начиная с нуля и до числа указанного в количестве циклов)
# range(1,2) - где 1 - число с которого начнётся цикл, 2 - до какого число (не включая его)
# range(1,2,3) - где 3 - число на которое увеличивается с каждым числом (инкримент). По дефолту это 0  
# found = None - создание переменной без значения
# --------------------------------------------------#


# for i in range(1, 12, 2):
#   print(i)
# --------------------------------------------------#


# word = "Hello World!"
# count = 0

# for i in word:
#   if i == "l":
#     count += 1

# print(count)
# --------------------------------------------------#


# i = 5

# while i <= 15:
#   print(i)
#   i +=1 
# --------------------------------------------------#


# isHasCar = True

# while isHasCar:
#   if input("Введите 'Stop' для прерывания цикла: ") == "Stop":
#     isHasCar = False
# --------------------------------------------------#


# for i in range(1, 11):
#   if i > 5:
#     break
#   print(i)
# --------------------------------------------------#


# for i in range(1, 11):
#   if i > 9:
#     break

#   if i % 2 == 0:
#     continue

#   print(i)
# --------------------------------------------------#


found = None

for i in "Hello":
  if i == "l":
    found = True
    break
  
  else:
    found = False
  
print(found)