# Comment
# \n -  новая строка
# \t - табуляция (пробел)
# \\ - добавить слеш
# sep="" - указаник символа пробела
# end=". " - указание символа конца строки
# Мат. деление с округлением (в меньшую сторону)- // 
# min() - выбирает минимальное число из массива
# max() - выбирает максимальное число из массива
# abs() - находит число по модулю (из отрицательного в положительное)
# pow(1,2) - возведееие в степень. где 1 - число, а 2 - степень
# round() - округляет математический резултат (в большую сторону) 
# input(1) - запрос данных у пользователя (меня), где 1 - сообщение которое отобразится в консоле
# --------------------------------------------------#


# print("Результат : ", 10,", ", 15, sep="", end=". ")
# print("Sec\t \\ ond line \" ")


# print ("Резултат:", 5 // 3) # Деление с остатком от целого числа
# print ("Резултат:", min(-1, 2, 50, -3000))
# print ("Резултат:", max(-1, 2, 50, -3000))
# print ("Резултат:", abs(-100))
# print ("Резултат:", pow(10, 3))
# print ("Резултат:", round(3 / 2))
# print ("Резултат:", 3 / 2)


input("Введите свой возраст: ")